БухЭксп/InformationRegisters/CW_ОбработчикиОбновления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбработчикиОбновления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОбработчиковОбновления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РежимыВыполненияОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачальноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриКаждомОбновлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыОбработчиковОбновления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыОбработчиковОбновления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнялся</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_РежимыВыполненияОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РежимыВыполненияОбработчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оперативно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложенно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonModules/CW_ОбновлениеКонфигурацииСлужебный/Ext/Module.bsl
//см.CW_ОбновлениеКонфигурацииСервер.ПриДобавленииОбработчиковОбновления()
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт  

	//Процедуры первого запуска конфигурации   
	ДобавитьПроцедурыПервогоЗапуска(Обработчики);
	//Процедуры первого запуска конфигурации   

	//Процедуры первого запуска при каждом обновлении   
	ДобавитьПроцедурыЗапускаПриКаждомОбновлении(Обработчики);
	//Процедуры первого запуска конфигурации  
	
	//Процедуры обновления на версию   
	ДобавитьПроцедурыОбновленияНаВерсию(Обработчики);
	//Процедуры обновления на версию    
	
КонецПроцедуры   

Процедура ДобавитьПроцедурыПервогоЗапуска(Обработчики)
	
	//НоваяСтрока = Обработчики.Добавить();
	//НоваяСтрока.ИмяОбработчика  		= "";  
	//НоваяСтрока.Версия 				= "*";
	//НоваяСтрока.ИмяПодсистемы 		= "CW_СтандартныеПодсистемы";
	//НоваяСтрока.НачальноеЗаполнение	= Истина;
	//НоваяСтрока.ПриКаждомОбновлении	= Ложь;
	//НоваяСтрока.РежимВыполнения		= "Оперативно";
	//НоваяСтрока.ОчередьВыполнения		= 2;
	//НоваяСтрока.Наименование			= "<>";
	//НоваяСтрока.Комментарий			= "<>";   
	
КонецПроцедуры 	    

Процедура ДобавитьПроцедурыЗапускаПриКаждомОбновлении(Обработчики) Экспорт  

	НоваяСтрока = Обработчики.Добавить();
	НоваяСтрока.ИмяОбработчика  	= "CW_ОбновлениеКонфигурацииСлужебный.УдалитьУстановленныеРасширения";  
	НоваяСтрока.Версия 				= "*";
	НоваяСтрока.ИмяПодсистемы 		= "CW_СтандартныеПодсистемы";
	НоваяСтрока.НачальноеЗаполнение	= Ложь;
	НоваяСтрока.ПриКаждомОбновлении	= Истина;
	НоваяСтрока.РежимВыполнения		= "Оперативно";
	НоваяСтрока.ОчередьВыполнения	= 2;
	НоваяСтрока.Наименование		= "Удалить установленные исправления";
	НоваяСтрока.Комментарий			= "Удаляет неактуалтные исправления";   
	
КонецПроцедуры

Процедура ДобавитьПроцедурыОбновленияНаВерсию(Обработчики)
	
	////Версия 8.3.0.0
	//НоваяСтрока = Обработчики.Добавить();
	//НоваяСтрока.ИмяОбработчика  		= "CW_ОбновлениеКонфигурацииСлужебный.<...>";  
	//НоваяСтрока.Версия 				= "8.3.0.0";
	//НоваяСтрока.ИмяПодсистемы 		= "CW_СтандартныеПодсистемы";
	//НоваяСтрока.НачальноеЗаполнение	= Ложь;
	//НоваяСтрока.ПриКаждомОбновлении	= Истина;
	//НоваяСтрока.РежимВыполнения		= "Оперативно";
	//НоваяСтрока.ОчередьВыполнения		= 9;
	//НоваяСтрока.Наименование			= "<>";
	//НоваяСтрока.Комментарий			= "<>";   
	////Версия 8.3.0.0
	
КонецПроцедуры 


//Обязательные процедуры при переходе на каждый релиз
Процедура УдалитьУстановленныеРасширения(АдресРезультата=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);   
	
	ИмяОсновнойПодсистемы 	= CW_ВерсииПодсистемСервер.ИмяОсновнойПодсистемы();
	ОписаниеПодсистем 		= Новый Структура;
	CW_ОбновлениеКонфигурацииСервер.ПриДобавленииПодсистем(ОписаниеПодсистем); 
	
	ТекущаяВерсия 		= Неопределено;
	ОписаниеПодсистем.Свойство(ИмяОсновнойПодсистемы, ТекущаяВерсия); 
	Если ТекущаяВерсия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВсеРасширения = РасширенияКонфигурации.Получить();
	
	ИдентификаторыРасширений = Новый Массив;
	Для Каждого Расширение Из ВсеРасширения Цикл
		Если Не CW_ИсправленияКонфигурации.ЭтоИсправление(Расширение)Тогда
			Продолжить;
		КонецЕсли;
		Если Не CW_ИсправленияКонфигурации.ЭтоУдаляемоеИсправление(Расширение, ТекущаяВерсия)Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторыРасширений.Добавить(Расширение.УникальныйИдентификатор);
	КонецЦикла;
	
	ТекстОшибки = "";
	Справочники.ВерсииРасширений.УдалитьРасширения(ИдентификаторыРасширений, ТекстОшибки);
	УстановитьПривилегированныйРежим(Ложь);
	ТребуетсяПерезапуск = Ложь;
	
	Если ПустаяСтрока(ТекстОшибки) Тогда
		ТребуетсяПерезапуск = ИдентификаторыРасширений.Количество() > 0;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТребуетсяПерезапуск", ТребуетсяПерезапуск);
	
	ПоместитьВоВременноеХранилище(СтруктураПараметров, АдресРезультата);
	
КонецПроцедуры
//Обязательные процедуры при переходе на каждый релиз


Процедура ВыполнитьОтложенноеОбновление() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбработчикиОбновления.ИмяОбработчика КАК ИмяОбработчика,
	               |	CW_ОбработчикиОбновления.ИмяПодсистемы КАК ИмяПодсистемы,
	               |	CW_ОбработчикиОбновления.НачальноеЗаполнение КАК НачальноеЗаполнение,
	               |	CW_ОбработчикиОбновления.ПриКаждомОбновлении КАК ПриКаждомОбновлении,
	               |	CW_ОбработчикиОбновления.ОчередьВыполнения КАК ОчередьВыполнения,
	               |	CW_ОбработчикиОбновления.Версия КАК Версия,
	               |	0 КАК Разряд_1,
	               |	0 КАК Разряд_2,
	               |	0 КАК Разряд_3,
	               |	0 КАК Разряд_4
	               |ИЗ
	               |	РегистрСведений.CW_ОбработчикиОбновления КАК CW_ОбработчикиОбновления
	               |ГДЕ
	               |	CW_ОбработчикиОбновления.Статус = ЗНАЧЕНИЕ(Перечисление.CW_СтатусыОбработчиковОбновления.НеВыполнялся)
	               |	И CW_ОбработчикиОбновления.РежимВыполнения = ЗНАЧЕНИЕ(Перечисление.CW_РежимыВыполненияОбработчиков.Отложенно)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ОбработчикиОбновления.НачальноеЗаполнение УБЫВ,
	               |	CW_ОбработчикиОбновления.ОчередьВыполнения
	               |АВТОУПОРЯДОЧИВАНИЕ";

	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
	
	Для Каждого СтрокаТаблицы из ТаблицаЗапроса Цикл  
		
		Если СтрокаТаблицы.Версия = "*" тогда
			Продолжить;
		КонецЕсли;
		
		мРазряды = СтрРазделить(СтрокаТаблицы.Версия, ".");
		
		СтрокаТаблицы.Разряд_1 = Число(мРазряды[0]);	
		СтрокаТаблицы.Разряд_2 = Число(мРазряды[1]);	
		СтрокаТаблицы.Разряд_3 = Число(мРазряды[2]);	
		СтрокаТаблицы.Разряд_4 = Число(мРазряды[3]);	

	КонецЦикла;   
	
	ТаблицаЗапроса.Сортировать("Версия ВОЗР, Разряд_1 ВОЗР, Разряд_2 ВОЗР, Разряд_3 ВОЗР, Разряд_4 ВОЗР, НачальноеЗаполнение УБЫВ, ПриКаждомОбновлении УБЫВ, ОчередьВыполнения ВОЗР");	
	
	Для Каждого СтрокаТаблицы из ТаблицаЗапроса Цикл     
		РезульатВыполнения = ВыполнитьЗаданиеНаСервере(СтрокаТаблицы.ИмяОбработчика);  
	КонецЦикла;  
	
	//После выполнения отключаем задение
	CW_ОбновлениеКонфигурацииСервер.УстановитьИспользованиеОтложенногоВыпоненияОбработок();
	
КонецПроцедуры

Функция ВыполнитьЗаданиеНаСервере(ИмяОбработчика) Экспорт
	
	Возврат CW_ОбновлениеКонфигурацииСервер.ВыполнитьЗаданиеНаСервере(ИмяОбработчика);
	
КонецФункции
